perf/results/saved_clickhouse/saved_clickhouse/write_200rps.txt
Running 30s test @ http://localhost:9411
  4 threads and 50 connections
  Thread calibration: mean lat.: 2.324ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.312ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.247ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.226ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.73ms    6.00ms  68.22ms   96.66%
    Req/Sec    54.97     98.05   800.00     79.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.64ms
 75.000%    2.15ms
 90.000%    3.13ms
 99.000%   40.83ms
 99.900%   61.25ms
 99.990%   68.29ms
 99.999%   68.29ms
100.000%   68.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.237     0.000000            1         1.00
       0.879     0.100000          399         1.11
       1.137     0.200000          797         1.25
       1.319     0.300000         1198         1.43
       1.486     0.400000         1596         1.67
       1.644     0.500000         1992         2.00
       1.725     0.550000         2192         2.22
       1.815     0.600000         2392         2.50
       1.917     0.650000         2590         2.86
       2.027     0.700000         2790         3.33
       2.149     0.750000         2988         4.00
       2.233     0.775000         3088         4.44
       2.331     0.800000         3188         5.00
       2.449     0.825000         3287         5.71
       2.601     0.850000         3388         6.67
       2.793     0.875000         3486         8.00
       2.911     0.887500         3537         8.89
       3.133     0.900000         3586        10.00
       3.393     0.912500         3636        11.43
       3.891     0.925000         3686        13.33
       4.491     0.937500         3735        16.00
       4.839     0.943750         3760        17.78
       5.399     0.950000         3785        20.00
       6.311     0.956250         3810        22.86
       7.379     0.962500         3835        26.67
       9.311     0.968750         3860        32.00
      10.759     0.971875         3872        35.56
      12.655     0.975000         3885        40.00
      15.159     0.978125         3897        45.71
      20.543     0.981250         3910        53.33
      29.455     0.984375         3922        64.00
      32.143     0.985938         3928        71.11
      36.511     0.987500         3935        80.00
      39.711     0.989062         3941        91.43
      41.599     0.990625         3947       106.67
      45.855     0.992188         3953       128.00
      48.895     0.992969         3956       142.22
      49.119     0.993750         3960       160.00
      50.495     0.994531         3963       182.86
      52.671     0.995313         3966       213.33
      54.527     0.996094         3969       256.00
      54.623     0.996484         3970       284.44
      55.263     0.996875         3972       320.00
      56.991     0.997266         3974       365.71
      57.759     0.997656         3975       426.67
      59.551     0.998047         3977       512.00
      59.551     0.998242         3977       568.89
      60.223     0.998437         3978       640.00
      60.767     0.998633         3979       731.43
      61.247     0.998828         3980       853.33
      63.263     0.999023         3981      1024.00
      63.263     0.999121         3981      1137.78
      63.263     0.999219         3981      1280.00
      64.639     0.999316         3982      1462.86
      64.639     0.999414         3982      1706.67
      64.671     0.999512         3983      2048.00
      64.671     0.999561         3983      2275.56
      64.671     0.999609         3983      2560.00
      64.671     0.999658         3983      2925.71
      64.671     0.999707         3983      3413.33
      68.287     0.999756         3984      4096.00
      68.287     1.000000         3984          inf
#[Mean    =        2.725, StdDeviation   =        5.997]
#[Max     =       68.224, Total count    =         3984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6004 requests in 30.00s, 615.64KB read
Requests/sec:    200.11
Transfer/sec:     20.52KB